---
layout: post
title: Dicas valiosas para sprints
---

<p>Ol&aacute;. Bem, &eacute; como dizem por ai: &ldquo;Life got real!&rdquo;. Mas, enfim, estou aqui de volta.</p>
<p>Ainda tratando de sprints. Seguindo na mesma linha do <a title="Tamanho ideal de sprint/itera&ccedil;&atilde;o (Scrum/XP)." href="http://horewicz.net/tamanho-ideal-de-sprintiteracao-scrumxp/">post anterior</a>. Acho que ficou claro que n&atilde;o &eacute; sensato abra&ccedil;ar cegamente o que &eacute; sugerido pela literatura, e sim saber reconhecer a ess&ecirc;ncia do que &eacute; proposto e conseguir adaptar e aplicar &agrave; sua realidade. E al&eacute;m do mais, saber aplicar tais conceitos a cada caso &eacute; o tipo de tarefa que s&oacute; se consegue realizar com a pr&aacute;tica do dia-a-dia. E foi justamente com a pr&aacute;tica do dia-a-dia que eu percebi alguns detalhes nos meus projetos. Seguinte:</p>
<ul>
<li><strong>Fixe os dias da semana para marcar suas reuni&otilde;es de planejamento e retrospectiva (sprint planning e review).</strong> Por exemplo, todos os plannings acontecem na segunda-feira e todos os reviews na sexta-feira. Dessa forma voc&ecirc; acaba criando um v&iacute;nculo e fica mais f&aacute;cil de todos se organizarem e dificilmente algu&eacute;m vai esquecer da reuni&atilde;o;</li>
<li> <strong>Certifique-se que os dias dos sprints planning e reviews est&atilde;o &ldquo;funcionando&rdquo; pra voc&ecirc;.</strong> O que eu quero dizer com funcionando, &eacute; se est&atilde;o sendo reuni&otilde;es produtivas. Nos meus primeiros projetos eu reservava a segunda-feira para o planejamento e a sexta-feira (da outra semana) para as retrospectivas. Tiro no p&eacute;! Ningu&eacute;m, nem a equipe, nem o Product Owner estavam motivados para come&ccedil;ar a semana com uma reuni&atilde;o. Estas sempre come&ccedil;avam atrasadas e era n&iacute;tido que o pessoal ainda estava &ldquo;regulando a marcha lenta&rdquo;. Muito menos encarar uma retrospectiva de 4 horas em plena sexta-feira! Bastou trocar os dias e a coisa come&ccedil;ou a funcionar;</li>
<li><strong>Lan&ccedil;ar novas vers&otilde;es do produto na sexta-feira pode n&atilde;o ser uma boa id&eacute;ia.</strong> Ningu&eacute;m quer voltar para casa, muito menos correr o risco de perder o final de semana com aquela preocupa&ccedil;&atilde;o de que algo pode dar errado. Uma coisa que funcionou comigo foi definir um deadline na quinta-feira. E deixar a sexta-feira apenas para algumas tarefas administrativas e reviews;</li>
<li><strong>Crie tags no seu sistema de controle vers&atilde;o para cada sprint.</strong> Isso se voc&ecirc; estiver utilizando controle de vers&atilde;o, pois se n&atilde;o estiver, voc&ecirc; definitivamente deveria!</li>
<li><strong>Evite entregar tudo o que foi produzido apenas ao final da itera&ccedil;&atilde;o. A medida que as tarefas forem sendo finalizadas, disponibilize para o cliente.</strong> Agilidade est&aacute; diretamente relacionada a feedback. Se voc&ecirc; deixar para entregar tudo que foi feito ao final do sprint, voc&ecirc; s&oacute; tera o feedback do cliente no pr&oacute;ximo sprint, o que pode acabar atrasando as coisas, haja vista j&aacute; existem tarefas definidas para esse (pr&oacute;ximo) sprint. Esse assunto tamb&eacute;m foi abordado neste <a title="Incrementos e Itera&ccedil;&otilde;es" href="http://www.phidelis.com.br/blogs/alissonvale/2007/07/16/IncrementosEIteraccedilotildees.aspx">excelente artigo</a> do <a title="Alisson Vale" href="http://www.phidelis.com.br/blogs/alissonvale/">Alisson Vale</a>, inclusive batizado com um nome bastente adequado: &ldquo;S&iacute;ndrome da Itera&ccedil;&atilde;o Inacabada&rdquo;.</li>
</ul>
<p>Bem, por hora &eacute; isso. Como cada empresa ou projeto, cada situa&ccedil;&atilde;o tem suas peculiaridades, eu gostaria que voc&ecirc;s compartilhassem suas experi&ecirc;ncias com rela&ccedil;&atilde;o a esse assunto. Os coment&aacute;rio est&atilde;o abertos. Caso voc&ecirc; n&atilde;o tenha passado por isso ainda, espero que esses t&oacute;picos possam te poupar algum tempo.</p>
<p>Sem mais.</p>
