---
layout: post
title: Tamanho ideal de sprint/iteração (Scrum/XP)
---

<p>Antes que comecem as cr&iacute;ticas, quero deixar claro que o t&iacute;tulo escolhido foi proposital. N&atilde;o por provoca&ccedil;&atilde;o, pelo contr&aacute;rio, mas para tentar abrir os olhos de quem ainda acredita que seguir &agrave; risca a bibliografia &eacute; sempre a melhor solu&ccedil;&atilde;o. E acaba ferindo (mesmo que cegamente) um dos princ&iacute;pios mais importantes da Agilidade: <strong>Adapta&ccedil;&atilde;o</strong>.</p>
<p>N&atilde;o me recordo o n&uacute;mero, mas posso afirmar que n&atilde;o foram poucas as vezes que ouvi ou li algu&eacute;m questionando sobre o tamanho dos sprints ou itera&ccedil;&otilde;es. Se eram obrigados a trabalhar com 30 dias, ou se optando por um valor diferente estariam certos ou errados.</p>
<p>Para quem esperava uma solu&ccedil;&atilde;o simples e objetiva, sinto muito. A verdade &eacute; que n&atilde;o existe bala de prata, nem certo ou errado. N&atilde;o existe um tamanho ideal que se aplique a todas as ocasi&otilde;es. Cada caso &eacute; um caso. Mesmo em uma equipe que n&atilde;o sofre altera&ccedil;&otilde;es de pessoal, um tamanho adequado para um projeto, pode n&atilde;o ter a mesma efici&ecirc;ncia em outro.</p>
<p>O Scrum sugere sprints com 30 dias (um m&ecirc;s) de dura&ccedil;&atilde;o (<em>&ldquo;Do I need to stick to a month time frame?&rdquo;</em> em <a title="Scrum FAQ Podcast Transcript" href="http://blogs.conchango.com/howardvanrooijen/archive/2006/01/05/2553.aspx" target="_blank">Scrum FAQ</a>, ou na <a title="Scrum FAQ em portugu&ecirc;s" href="http://dojofloripa.wordpress.com/2007/09/28/scrum-faq-em-portugues/" target="_blank">vers&atilde;o traduzida</a>).  O XP sugere <a title="Ciclo Semanal" href="http://www.improveit.com.br/xp/praticas/ciclo_semanal" target="_blank">ciclos semanais</a>. Durante meu treinamento Certified ScrumMaster foi proposto sprints de 28 dias, pois facilita visualiza&ccedil;&atilde;o em termos de semanas. Al&eacute;m desses, eu j&aacute; tive oportunidade de trabalhar com sprints de 1 e 2 semanas. O que eu sugiro pra voc&ecirc;: Experimente! S&oacute; assim voc&ecirc; vai ser capaz de dizer o que &eacute; apropriado para cada ocasi&atilde;o. No mais, eu s&oacute; posso citar alguns pontos que devem ser levados em considera&ccedil;&atilde;o para a sua decis&atilde;o:</p>
<ul>
<li>Escolha uma dura&ccedil;&atilde;o a qual seja agrad&aacute;vel trabalhar, tal que a equipe consiga manter um <a title="What is Extreme Programming?" href="http://www.xprogramming.com/xpmag/whatisxp.htm#sustainable" target="_blank">ritmo sustent&aacute;vel</a>. Sprints muito longos podem levar &agrave; procrastina&ccedil;&atilde;o (<a title="Sindrome do Estudante" href="http://pt.wikipedia.org/wiki/Procrastina%C3%A7%C3%A3o" target="_blank">S&iacute;ndrome do Estudante</a>). J&aacute; sprints muito curtos conseguem ser bem estressantes quando algum imprevisto acontece;</li>
<li>Requisitos mudam com freq&uuml;&ecirc;ncia (i.e., o cliente muda os planos constantemente ou &eacute; incapaz de especificar com clareza o que deseja). Se for pra algo dar errado, que seja agora e n&atilde;o daqui 15 dias. Ou seja, quanto antes voc&ecirc; perceber que esta no caminho errado, o esfor&ccedil;o para voltar atr&aacute;s &eacute; menor. E voc&ecirc; s&oacute; conhece esse caminho a partir do feedback, o que (geralmente) acontece mais frequentemente em sprints curtos;</li>
<li>Semelhante as incertezas do cliente, deve-se ponderar as incertezas da equipe. Pois esta pode ser incapaz de dizer o quanto consegue trabalhar por itera&ccedil;&atilde;o ou desconhece de aspectos t&eacute;cnicos do projeto;</li>
<li>Da mesma forma que os requisitos podem mudar, o mesmo pode acontecer com suas prioridades. O seu tempo de resposta para eventuais mudan&ccedil;as esta intimamente ligado &agrave; dura&ccedil;&atilde;o dos sprints;</li>
<li>Prepara&ccedil;&atilde;o (overhead) para os sprints. Suponha que antes de cada sprint todo o sistema precise passar por uma bateria de testes, ou que todo desenvolvedor deva reinstalar seu sistema e ambiente de desenvolvimento por medidas de seguran&ccedil;a da empresa. Sem d&uacute;vida sprints curtos n&atilde;o s&atilde;o a melhor escolha nesse caso. O ideal seria reduzir ou eliminar estes impedimentos, mas nem sempre isso &eacute; poss&iacute;vel.</li>
</ul>
<p>Bem, se voc&ecirc; tinha d&uacute;vidas com rela&ccedil;&atilde;o o tamanho dos seus sprints, espero esses t&oacute;picos sirvam como ponto de partida para uma poss&iacute;vel mudan&ccedil;a. Mas n&atilde;o esque&ccedil;a que at&eacute; mesmo as mudan&ccedil;as visando melhorias t&ecirc;m seus efeitos colaterais. Portanto, uma vez definida uma dura&ccedil;&atilde;o apropriada para seus sprints, respeite esse valor, pois s&oacute; assim voc&ecirc; ser&aacute; capaz de manter um ritmo (velocidade) de trabalho.</p>
<p><strong>Inspect and Adapt! </strong></p>
