---
layout: post
title: Escrevendo boas User Stories
---

<p>Como bem sabemos, um dos <a style="opacity: 1;" href="http://agilemanifesto.org/principles.html">princ&iacute;pios</a> dos processos &Aacute;geis &eacute; satisfazer o cliente, agregando valor  ao produto final. De certa forma, para que essa tarefa possa ser realizada com sucesso, &eacute; preciso saber exatamente as necessidades desse cliente.</p>
<p>Felizmente com algumas <a href="http://www.extremeprogramming.org/rules/userstories.html">est&oacute;rias</a> e feedbacks j&aacute; &eacute; poss&iacute;vel ter uma boa id&eacute;ia de onde devemos chegar. Mas &eacute; importante ressaltar que a &ldquo;qualidade&rdquo; das est&oacute;rias influencia diretamente em todo o processo.</p>
<p>As est&oacute;rias apresentam tr&ecirc;s aspectos cr&iacute;ticos, os quais devem ser obrigatoriamente lembrados no momento de sua cria&ccedil;&atilde;o. S&atilde;o eles: <strong>C</strong>ards, <strong>C</strong>onversation, <strong>C</strong>onfirmation. Ou <strong>3C</strong>.</p>
<blockquote>
<p><strong>C</strong>ards &mdash; Est&oacute;rias s&atilde;o escritas em <strong>cart&otilde;es</strong> ou post-its. Na verdade o que importa aqui &eacute; o tamanho! A sugest&atilde;o dos cart&otilde;es e post-its &eacute; pelo fato de serem pequenos. E cart&otilde;es pequenos naturalmente for&ccedil;am est&oacute;rias pequenas, de duas a tr&ecirc;s linhas no m&aacute;ximo.</p>
<p><strong>C</strong>onversation &mdash; A est&oacute;ria escrita no cart&atilde;o serve como um lembrete, uma maneira de identificar uma funcionalidade que foi <strong>conversada</strong> e discutida entre os clientes e desenvolvedores.</p>
<p><strong>C</strong>onfirmation &mdash; Depois das funcionalidades terem sido discutidas e escritas nos cart&otilde;es, o cliente define (impl&iacute;cita ou explicitamente) uma maneira de validar esse pedido. Geralmente essa <strong>confirma&ccedil;&atilde;o</strong> &eacute; feita com testes de aceita&ccedil;&atilde;o.</p>
</blockquote>
<p>Para criar boas est&oacute;rias, ainda devemos focar em seis atributos: <strong>INVEST</strong></p>
<blockquote>
<p><strong>I</strong>ndependent &mdash; Est&oacute;rias devem ser independentes uma das outras. Depend&ecirc;ncias entre est&oacute;rias geram problemas de planejamento e prioriza&ccedil;&atilde;o, sem falar que dificultam bastante nas estimativas.</p>
<p><strong>N</strong>egotiable &mdash; Est&oacute;rias n&atilde;o s&atilde;o contratos. Como dito anteriomente, est&oacute;rias s&atilde;o lembretes para funcionalidades discutidas (negociadas) entre o cliente e os desenvolvedores.</p>
<p><strong>V</strong>aluable &mdash; Na mesma linha dos processos &Aacute;geis, como dito no in&iacute;cio deste post. Est&oacute;rias devem agregar valor para o cliente.</p>
<p><strong>E</strong>stimatable &mdash; Os desenvolvedores devem ser capazes de estimar o tamanhos das est&oacute;rias. Geralmente est&oacute;rias incompletas ou muito grandes (complexas) s&atilde;o dif&iacute;ceis de serem estimadas. Portanto invista em discuss&otilde;es e quebre em est&oacute;rias menores quando necess&aacute;rio.</p>
<p><strong>S</strong>mall &mdash; &ldquo;Tamanho &eacute; documento&rdquo;. Essa regra &eacute; valida para a cria&ccedil;&atilde;o de boas est&oacute;rias. Como dito anteriormente, est&oacute;rias grandes dificultam as estimativas. Bem como est&oacute;rias muito pequenas. Quebre ou agrupe dependendo do caso.</p>
<p><strong>T</strong>estable &mdash;  Est&oacute;rias devem ser poss&iacute;veis de serem testadas. Um teste que &eacute; executado com sucesso, prova que a est&oacute;ria foi desenvolvida com sucesso, atingindo as necessidades do cliente. Est&oacute;rias que n&atilde;o podem ser testadas geralmente especificam requisitos n&atilde;o-funcionais do software, e n&atilde;o uma funcionalidade diretamente.</p>
</blockquote>
<p>Al&eacute;m do 3C e INVEST, vejamos mais alguns pontos. Foque as est&oacute;rias no &ldquo;O que&rdquo; e n&atilde;o no &ldquo;Porque&rdquo;. Est&oacute;rias <strong>n&atilde;o</strong> devem apresentar termos t&eacute;cnicos e nem os m&iacute;nimos detalhes das funcionalidades. Lembre-se, elas s&atilde;o apenas lembretes do que foi discutido anteriomente.</p>
<p>Quando poss&iacute;vel aplique o &ldquo;Quem&rdquo;, &ldquo;O que&rdquo; e &ldquo;Como&rdquo;. Por exemplo: &ldquo;O visitante pode se cadastrar no portal pelo formul&aacute;rio&rdquo;, &ldquo;O visitante confirma seu cadastro por email&rdquo;, &ldquo;O usu&aacute;rio &eacute; capaz de salvar seus favoritos&rdquo;. Mas cuidado com o detalhismo!</p>
<p>Use e abuse de <a href="http://www.improveit.com.br/xp/praticas/metafora">met&aacute;foras</a>. Voc&ecirc; vai perceber como fica f&aacute;cil de explicar (ou entender) suas id&eacute;ias quando voc&ecirc; consegue comparar com algo concreto, do dia-a-dia das pessoas. Sem falar que assim voc&ecirc; consegue definir um vocabul&aacute;rio comum com o cliente.</p>
<p>Incentive o cliente a escrever as est&oacute;rias. Assim voc&ecirc; acaba for&ccedil;ando-o a explicar com clareza as suas necessidades e muitas vezes ajuda tamb&eacute;m a esclarecer poss&iacute;veis d&uacute;vidas.</p>
<p>Para finalizar, abaixo um trecho retirado de [1], que explica quase tudo em um &uacute;nico par&aacute;grafo:</p>
<blockquote>
<p><em>The story is the unit of functionality in an XP project. We demonstate progress by delivering tested, integrated code that implements a story. A story should be understandable to customers and developers, testable, valuable to the customer, and small enough so that the programmers can build half a dozen in an iteration</em>.</p>
</blockquote>
<p>Refer&ecirc;ncias/Leitura recomendada:</p>
<p>[1]  <a href="http://www.amazon.com/Planning-Extreme-Programming-Kent-Beck/dp/0201710919">Planning Extreme Programming.</a> Kent Beck, Martin Fowler<br /> [2]  <a href="http://www.xprogramming.com/xpmag/expCardConversationConfirmation.htm">Essential XP: Card, Conversation, Confirmation.</a> Ron Jeffries<br /> [3]  <a href="http://www.submarino.com.br/imports_productdetails.asp?Query=ProductPage&amp;ProdTypeId=9&amp;ProdId=744298&amp;franq=255004">User Stories Applied: For Agile Software Development</a>. Mike Cohn</p>
